// pages/api/products.js

const products = [
  {
    id: 1,
    name: "হিমসাগর আম",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,680.00 – ৳3,080.00",
    prices: [1680, 3080],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/himsagor.jpg",
  },
  {
    id: 2,
    name: "আমরুপালি",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,680.00 – ৳3,080.00",
    prices: [1680, 3080],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/khisshapat.jpg",
  },
  {
    id: 3,
    name: "ল্যাংড়া",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,620.00 – ৳2,970.00",
    prices: [1620, 2970],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/ল্যাংড়া.jpg",
  },
  {
    id: 4,
    name: "লক্ষনভোগ",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,200.00 – ৳2,200.00",
    prices: [1200, 2200],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/লক্ষনভোগ.jpg",
  },
  {
    id: 5,
    name: "ফজলি",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,200.00 – ৳2,200.00",
    prices: [1200, 2200],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/ফজলি.jpg",
  },
  {
    id: 6,
    name: "গোপালভোগ আম",
    description: {
      p1: "আম কাঁচা পন্য হওয়ায় বুকিং এর জন্য কিছু   এডভান্স করে বাকি টাকা ক্যাশ অন ডেলিভারিতে নিতে পারবেন। ",
      p2: "১২ কেজির জন্য  ৪০০ টাকা ",
      p3: "২২ কেজির জন্য ৬০০ টাকা পরিশোধ করুন। ",
      p4: "জেলা শহরে হোম ডেলিভারি করা হয়।",
      p5: "হোম ডেলিভারি চার্জ কেজি প্রতি ১০ টাকা করে আলাদা যুক্ত হবে। ",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳1,440.00 – ৳2,640.00 (Not Available)",
    prices: [1440, 2640],
    weights: ["12KG", "22KG"],
    selectedWeight: "22KG",
    quantity: 1,
    image: "/images/gopalvog.jpg",
  },
  {
    id: 7,
    name: "আচার",
    description: {
      p1: "Cash on delivery",
      p6: "01303546501 ",
      p7: "বিকাশ, নগদ, রকেট (পারসোনাল)",
    },
    priceRange: "৳570.00 – ৳1050.00",
    prices: [570, 1000],
    weights: ["1KG", "2KG"],
    selectedWeight: "2KG",
    quantity: 1,
    image: "/images/Aachar.jpg",
  },
];

export default function handler(req, res) {
  if (req.method === "GET") {
    // Respond with the list of products
    res.status(200).json(products);
  } else {
    // Handle any other HTTP method
    res.setHeader("Allow", ["GET"]);
    res.status(405).end(`Method ${req.method} Not Allowed`);
  }
}
