import React from "react";

const about = () => {
  return (
    <div className="container bg-slate-300 m-8 p-8">
      <h3 className=" text-lg text-blue-700 font-bold">আম</h3>
      <br />
      <p>
        চাঁপাইনবাবগঞ্জ জেলা বাংলাদেশের আমের রাজধানী হিসেবে পরিচিত, কারণ
        গ্রীষ্মকালীন এই ফলটি চাঁপাইনবাবগঞ্জ জেলার অর্থনীতির প্রধান উৎস।
        চাঁপাইনবাবগঞ্জ জেলার অধিকাংশ জমি বিভিন্ন ধরনের আমের গাছে ভরপুর থাকে।
        চাঁপাইনবাবগঞ্জ জেলায় সবচেয়ে বেশি আম উৎপন্ন হয় শিবগঞ্জ, ভোলাহাট,নাচোল
        ও গোমস্তাপুর উপজেলায়। চাঁপাইনবাবগঞ্জ জেলায় উৎপাদিত আমের মধ্যে হচ্ছে,
        ফজলি, ল্যাংড়া, ক্ষীরশাপাতি, আশ্বিনা, বোম্বাই অন্যতম ।
      </p>
    </div>
  );
};

export default about;
