import React from "react";

const About = () => {
  return (
    <div className="container mx-auto px-4 py-4 md:py-8">
      <img
        src="/images/heading-banner.jpg"
        alt="Banner"
        className="w-full rounded shadow-md"
      />

      <div className="mt-4 md:mt-8">
        <p className="text-justify text-sm md:text-base leading-relaxed md:leading-loose">
          চাঁপাইনবাবগঞ্জ জেলা বাংলাদেশের আমের রাজধানী হিসেবে পরিচিত, কারণ
          গ্রীষ্মকালীন এই ফলটি চাঁপাইনবাবগঞ্জ জেলার অর্থনীতির প্রধান উৎস।
          চাঁপাইনবাবগঞ্জ জেলার অধিকাংশ জমি বিভিন্ন ধরনের আমের গাছে ভরপুর থাকে।
          চাঁপাইনবাবগঞ্জ জেলায় সবচেয়ে বেশি আম উৎপন্ন হয় শিবগঞ্জ,
          ভোলাহাট,নাচোল ও গোমস্তাপুর উপজেলায়। চাঁপাইনবাবগঞ্জ জেলায় উৎপাদিত
          আমের মধ্যে হচ্ছে, ফজলি, ল্যাংড়া, ক্ষীরশাপাতি, আশ্বিনা, বোম্বাই
          অন্যতম। <br />
          সাধারণত পাকা আমে কমলা-হলুদ বা লালচে খোসা থাকে এবং সরস হওয়ায় এটি
          খাওয়ার জন্য উপযুক্ত থাকে, তবে রপ্তানি করার সময় প্রায়শই সবুজ
          খোসাযুক্ত কাঁচা আম বাছাই করা হয়। পাকানোর জন্য ইথিলিন ব্যবহার করা হলেও
          রপ্তানি করা অপরিপক্ব আমের প্রাকৃতিকভাবে পাকা ফলের মতো রস এবং স্বাদ
          নেই। নিম্নে কিছু দেশি জাতের নাম উল্লেখ করা হলোঃ <br />
          ফজলি, সুরমা ফজলী, আশ্বিনা, ক্ষীরমন, খিরসাপাত, হাড়িভাঙ্গা, আলফানসো,
          ল্যাংড়া, গৌড়মতি, গোপালভোগ, মধু চুষকী, বৃন্দাবনি, লখনা, তোতাপুরী
          (ম্যাট্রাস), রাণী পছন্দ, ক্ষিরসাপাত, আম্রপালি, হিমসাগর, বাতাসা, ক্ষুদি
          ক্ষিরসা, বোম্বাই, সুরমা ফজলি, সুন্দরী, বৈশাখী, ইয়ার চারা, রসকি জাহান,
          হীরালাল বোম্বাই, ওকরাং, মালদা, শেরীধণ, শামসুল সামার, বাদশা, রস কি
          গুলিস্তান, কন্দমুকাররার, নাম ডক মাই, বোম্বাই (চাঁপাই), ক্যালেন্ডা,
          রুবী, বোগলা, মালগোভা, হিমসাগর রাজশাহী, কালুয়া (নাটোর), চৌষা লখনৌ,
          সিডলেস, কালিভোগ, বাদশাভোগ, কুষ্ণকলি, পাটনাই, গুটি লক্ষনভোগ, বাগান
          বিলাস
        </p>
      </div>
    </div>
  );
};

export default About;
